foam/sim/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    outlet_bot
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    bot
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    wall-surface_body
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    baffle
    {
        type            noSlip;
    }
}

// ************************************************************************* //
