foam/sim/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.007;
        value           uniform 2;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    outlet_bot
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    bot
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    top
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    wall-surface_body
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    baffle
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
}

// ************************************************************************* //
