foam/sim/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.07;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    outlet_bot
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    bot
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    wall-surface_body
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    baffle
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}

// ************************************************************************* //
